11/data/attachments/2587ee388d0a91c5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_8f8a2516-79bd-414f-9748-102f43ea8c35</nif:username>
            <nif:friendToBeAdded>Ryan_wait_Actions_42574_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>